In [1]:
import pandas as pd

## 1.데이터 불러오기

In [2]:
selloutData = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")
selloutData

       REGIONID    PRODUCT  YEARWEEK       QTY
0           A60   PRODUCT4    201402      71.0
1           A60  PRODUCT59    201402   22275.0
2           A60  PRODUCT34    201402    4463.0
3           A60  PRODUCT47    201402       0.0
4           A60  PRODUCT56    201402      23.0
5           A60  PRODUCT57    201402      14.0
6           A60  PRODUCT12    201402    1186.0
7           A60   PRODUCT1    201402       7.0
8           A60  PRODUCT33    201402     101.0
9           A60  PRODUCT62    201402     336.0
10          A37  PRODUCT58    201402       0.0
11          A37  PRODUCT59    201402   11492.0
12          A37  PRODUCT34    201402     825.0
13          A31  PRODUCT58    201402       0.0
14          A31  PRODUCT59    201402     560.0
15          A31  PRODUCT34    201402     103.0
16          A04  PRODUCT58    201402       0.0
17          A04  PRODUCT63    201402     740.0
18          A04  PRODUCT15    201402     394.0
19          A04   PRODUCT4    201402    2550.0
20          A04  PRODUCT16    201402       4.0
21          A04  PRODUCT59    201402   36549.0
22          A04  PRODUCT34    201402    4773.0
23          A04  PRODUCT40    201402     146.0
24          A04  PRODUCT47    201402       5.0
25          A04  PRODUCT60    201402       9.0
26          A04  PRODUCT56    201402     109.0
27          A04  PRODUCT57    201402    1195.0
28          A04  PRODUCT12    201402   15028.0
29          A04   PRODUCT1    201402    1319.0
...         ...        ...       ...       ...
124628      A16  PRODUCT64    201630     188.0
124629      A16  PRODUCT48    201630      16.0
124630      A16  PRODUCT49    201630       9.0
124631      A16  PRODUCT74    201630      18.0
124632      A16  PRODUCT40    201630     285.0
124633      A16  PRODUCT47    201630     155.0
124634      A16  PRODUCT60    201630    2491.0
124635      A16  PRODUCT56    201630    2026.0
124636      A16  PRODUCT12    201630   17067.0
124637      A16   PRODUCT1    201630     168.0
124638      A16  PRODUCT41    201630       0.0
124639      A16  PRODUCT51    201630       0.0
124640      A16  PRODUCT68    201630       0.0
124641      A16  PRODUCT33    201630    3887.0
124642      A16  PRODUCT14    201630      95.0
124643      A10   PRODUCT2    201630   12570.0
124644      A10  PRODUCT58    201630    4461.0
124645      A10  PRODUCT63    201630    4308.0
124646      A10  PRODUCT15    201630       0.0
124647      A10   PRODUCT4    201630    3012.0
124648      A10  PRODUCT16    201630     231.0
124649      A10  PRODUCT59    201630  231024.0
124650      A10  PRODUCT34    201630   34436.0
124651      A10  PRODUCT40    201630       0.0
124652      A10  PRODUCT47    201630       4.0
124653      A10  PRODUCT60    201630     824.0
124654      A10  PRODUCT56    201630     275.0
124655      A10  PRODUCT61    201630       0.0
124656      A10  PRODUCT12    201630   15021.0
124657      A10   PRODUCT1    201630     568.0

[124658 rows x 4 columns]

## 2.데이터 통합

In [3]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
dtype: object

In [4]:
selloutData = selloutData.astype(str)

In [5]:
selloutData["QTY"] = selloutData["QTY"].astype(float)

In [6]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY         float64
dtype: object

In [7]:
selloutData[["REGIONID","PRODUCT"]]
selloutData.head(2)

  REGIONID    PRODUCT YEARWEEK      QTY
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0

In [8]:
cuData = pd.read_csv("../dataset/kopo_customerdata.csv") 
cuData.head(2)

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
1,1190338,State2,2,Male,0,1,0,1,46500,0,46500,0,0,0,1,0

In [9]:
cuData.filter(items=['CUSTOMERCODE','STATENAME','GENDER','TOTAL_AMOUNT']).head(3)

   CUSTOMERCODE STATENAME  GENDER  TOTAL_AMOUNT
0       1503989    State2    Male         30300
1       1190338    State2    Male         46500
2       1424715    State2  Female         22700

In [10]:
cuData.iloc[0:1,:]

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0

## 3.인덱스활용하여 조회하기

In [11]:
cuData.iloc[0:2,0:5]

   CUSTOMERCODE STATENAME  ST GENDER  DOB
0       1503989    State2   2   Male    0
1       1190338    State2   2   Male    0

In [12]:
##특정 컬럼의 인덱스 조회
cuData.columns.get_loc("STATENAME")

1

In [13]:
stColNo = cuData.columns.get_loc("STATENAME")

In [14]:
genColNo = cuData.columns.get_loc("GENDER")

In [15]:
cuData.iloc[0:6,genColNo]

0      Male
1      Male
2    Female
3      Male
4      Male
5      Male
Name: GENDER, dtype: object

In [16]:
#컬럼 검색을 리스트형으로 _ 근데 이렇게 하면 컬럼이 바뀌면 문제가 생김
cuData.iloc[0:5,[1,3]]

  STATENAME  GENDER
0    State2    Male
1    State2    Male
2    State2  Female
3    State2    Male
4    State2    Male

In [17]:
cuData.iloc[0:3,[stColNo,genColNo]]

  STATENAME  GENDER
0    State2    Male
1    State2    Male
2    State2  Female

## 4.이상데이터 정제 후 특정값을 바꿔서 새로운 컬럼에 넣기

In [18]:
import numpy as np

In [19]:
selloutData.head(2)

  REGIONID    PRODUCT YEARWEEK      QTY
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0

In [20]:
#실습1 반품데이터처리, 반품되어 재고가 마이너스인 데이터를 없애고 QTY_NEW 컬럼 생성
selloutData["QTY_NEW"] = np.where(selloutData["QTY"] < 0,0,selloutData["QTY"])
selloutData.head(1)

  REGIONID   PRODUCT YEARWEEK   QTY  QTY_NEW
0      A60  PRODUCT4   201402  71.0     71.0

In [21]:
#실습2_YEAR, WEEK 컬럼 생성 후 refinedSelloutData 변수에 담기 
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY         float64
QTY_NEW     float64
dtype: object

In [22]:
#실습2-1, YEAR, WEEK 컬럼 생성
selloutData["YEAR"] = selloutData.YEARWEEK.str[0:4]
selloutData["WEEK"]=selloutData.YEARWEEK.str[4:6]
selloutData.head(1)

  REGIONID   PRODUCT YEARWEEK   QTY  QTY_NEW  YEAR WEEK
0      A60  PRODUCT4   201402  71.0     71.0  2014   02

In [23]:
#실습2-2, 교수님 방법!!! _ WEEK가 52 이하인 데이터 조회함과 동시에 refinedSelloutData 변수에 담기 
# 비교할 때만 자료형을 바꾸는 방법
refinedSelloutData = selloutData[(selloutData.WEEK.astype(float) <= 52)]

In [24]:
refinedSelloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY         float64
QTY_NEW     float64
YEAR         object
WEEK         object
dtype: object

In [25]:
# 계속 바꾸겠다
refinedSelloutData = selloutData[selloutData["WEEK"].astype(float) <= 52]

In [26]:
refinedSelloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY         float64
QTY_NEW     float64
YEAR         object
WEEK         object
dtype: object

In [27]:
refinedSelloutData["WEEK"].max()

'52'

In [28]:
refinedSelloutData.head(1)

  REGIONID   PRODUCT YEARWEEK   QTY  QTY_NEW  YEAR WEEK
0      A60  PRODUCT4   201402  71.0     71.0  2014   02

In [29]:
#실습2-2, WEEK 가 52 이하인 데이터 조회 후 refinedSelloutData 변수에 담기 
selloutData["WEEK"] = selloutData["WEEK"].astype(float)

In [30]:
refinedData = selloutData[(selloutData.WEEK <= 52)]
refinedData.head(1)

  REGIONID   PRODUCT YEARWEEK   QTY  QTY_NEW  YEAR  WEEK
0      A60  PRODUCT4   201402  71.0     71.0  2014   2.0

In [31]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY         float64
QTY_NEW     float64
YEAR         object
WEEK        float64
dtype: object